99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer.c
#include "esp32_mquickjs_display_buffer.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_DISPLAY_BUFFER

#include "utils/esp32_mquickjs_font.h"
#include "utils/esp32_mquickjs_byte_source.h"
#include "esp32_mquickjs_core.h"
#include "utils/esp32_mquickjs_fs_path.h"

#include <errno.h>
#include <limits.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "esp_psram.h"

#define DISPLAY_BUFFER_MAX_DIMENSION 4096U
#define DISPLAY_BUFFER_SMALL_INTERNAL_LIMIT 8192U
#define DISPLAY_BUFFER_DEFAULT_CHUNK_BYTES 4096U
#define DISPLAY_BUFFER_STAGED_VIEW_KEY "__esp32qjsDisplayBufferStagedView"
#define DISPLAY_FONT_HEADER_SIZE 16U
#define DISPLAY_FONT_MAGIC0 'E'
#define DISPLAY_FONT_MAGIC1 'Q'
#define DISPLAY_FONT_MAGIC2 'F'
#define DISPLAY_FONT_MAGIC3 '1'
#define DISPLAY_FONT_FORMAT_BITMAP_FIXED 1U

typedef enum {
    DISPLAY_BUFFER_FORMAT_MONO1 = 1,
    DISPLAY_BUFFER_FORMAT_RGB565 = 2,
} display_buffer_format_t;

typedef enum {
    DISPLAY_BUFFER_LAYOUT_LINEAR = 1,
    DISPLAY_BUFFER_LAYOUT_PAGE_Y8 = 2,
} display_buffer_layout_t;

typedef enum {
    DISPLAY_BUFFER_STORAGE_AUTO = 1,
    DISPLAY_BUFFER_STORAGE_INTERNAL = 2,
    DISPLAY_BUFFER_STORAGE_PSRAM = 3,
    DISPLAY_BUFFER_STORAGE_DMA = 4,
} display_buffer_storage_t;

typedef struct {
    uint16_t width;
    uint16_t height;
    uint16_t stride;
    uint16_t page_height;
    uint8_t format;
    uint8_t layout;
    uint8_t storage;
    uint8_t closed;
    size_t byte_length;
    uint8_t *data;
    uint8_t *chunk;
    size_t chunk_size;
    size_t chunk_capacity;
    uint16_t foreground;
    uint16_t background;
    int dirty_x0;
    int dirty_y0;
    int dirty_x1;
    int dirty_y1;
} esp32_mquickjs_display_buffer_t;

typedef struct {
    esp32_mquickjs_bitmap_font_t font;
    uint8_t *glyphs;
    char *name;
} esp32_mquickjs_display_font_t;

static uint32_t read_u32_le(const uint8_t *bytes)
{
    return (uint32_t)bytes[0] |
           ((uint32_t)bytes[1] << 8) |
           ((uint32_t)bytes[2] << 16) |
           ((uint32_t)bytes[3] << 24);
}

static char *display_font_copy_name(const char *name)
{
    size_t length;
    char *copy;

    if (name == NULL || name[0] == '\0') {
        name = "font";
    }
    length = strlen(name);
    copy = heap_caps_malloc(length + 1, MALLOC_CAP_8BIT);
    if (copy == NULL) {
        return NULL;
    }
    memcpy(copy, name, length + 1);
    return copy;
}

static void display_font_free(esp32_mquickjs_display_font_t *font)
{
    if (font == NULL) {
        return;
    }
    heap_caps_free(font->glyphs);
    heap_caps_free(font->name);
    heap_caps_free(font);
}

static esp32_mquickjs_display_font_t *display_font_from_value(JSContext *ctx,
                                                              JSValue value,
                                                              const char *api_name)
{
    esp32_mquickjs_display_font_t *font;

    if (JS_GetClassID(ctx, value) != JS_CLASS_DISPLAY_FONT) {
        JS_ThrowTypeError(ctx, "%s expects a DisplayFont", api_name);
        return NULL;
    }
    font = JS_GetOpaque(ctx, value);
    if (font == NULL || font->font.glyphs == NULL) {
        JS_ThrowReferenceError(ctx, "%s failed because the DisplayFont is closed", api_name);
        return NULL;
    }
    return font;
}

static const char *format_name(uint8_t format)
{
    return format == DISPLAY_BUFFER_FORMAT_RGB565 ? "rgb565" : "mono1";
}

static const char *layout_name(uint8_t layout)
{
    return layout == DISPLAY_BUFFER_LAYOUT_PAGE_Y8 ? "page-y8" : "linear";
}

static bool string_equals(const char *value, const char *expected)
{
    return value != NULL && strcmp(value, expected) == 0;
}

static bool value_to_u32(JSContext *ctx, JSValue value, uint32_t *out_value)
{
    int raw_value = 0;

    if (JS_ToInt32(ctx, &raw_value, value) != 0 || raw_value < 0) {
        return false;
    }
    *out_value = (uint32_t)raw_value;
    return true;
}

static bool value_to_i32(JSContext *ctx, JSValue value, int32_t *out_value)
{
    int raw_value = 0;

    if (JS_ToInt32(ctx, &raw_value, value) != 0) {
        return false;
    }
    *out_value = (int32_t)raw_value;
    return true;
}

static bool value_to_bool(JSContext *ctx, JSValue value, bool *out_value)
{
    int raw_value = 0;

    if (JS_IsBool(value)) {
        *out_value = value == JS_TRUE;
        return true;
    }
    if (JS_IsUndefined(value) || JS_IsNull(value)) {
        *out_value = false;
        return true;
    }
    if (JS_ToInt32(ctx, &raw_value, value) != 0) {
        return false;
    }
    *out_value = raw_value != 0;
    return true;
}

static uint16_t normalize_color(JSContext *ctx,
                                uint8_t format,
                                JSValue value,
                                uint16_t fallback,
                                bool *ok)
{
    uint32_t raw = fallback;
    bool enabled = false;

    if (ok != NULL) {
        *ok = true;
    }
    if (JS_IsUndefined(value) || JS_IsNull(value)) {
        return fallback;
    }
    if (format == DISPLAY_BUFFER_FORMAT_MONO1) {
        if (!value_to_bool(ctx, value, &enabled)) {
            if (ok != NULL) {
                *ok = false;
            }
            return 0;
        }
        return enabled ? 1U : 0U;
    }
    if (!value_to_u32(ctx, value, &raw) || raw > 0xffffU) {
        if (ok != NULL) {
            *ok = false;
        }
        return 0;
    }
    return (uint16_t)raw;
}

static JSValue get_option(JSContext *ctx, JSValue options, const char *name)
{
    return JS_GetPropertyStr(ctx, options, name);
}

static bool get_u32_option(JSContext *ctx,
                           JSValue options,
                           const char *name,
                           uint32_t *out_value,
                           bool required,
                           const char *api_name)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool ok = true;

    *property = get_option(ctx, options, name);
    if (JS_IsException(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (JS_IsUndefined(*property) || JS_IsNull(*property)) {
        if (required) {
            JS_ThrowTypeError(ctx, "%s requires option '%s'", api_name, name);
            ok = false;
        }
    } else if (!value_to_u32(ctx, *property, out_value)) {
        JS_ThrowTypeError(ctx, "%s option '%s' expects a non-negative integer", api_name, name);
        ok = false;
    }
    JS_PopGCRef(ctx, &property_ref);
    return ok;
}

static bool get_string_option(JSContext *ctx,
                              JSValue options,
                              const char *name,
                              const char **out_value,
                              JSCStringBuf *out_buf,
                              bool required,
                              const char *api_name)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool ok = true;

    *property = get_option(ctx, options, name);
    if (JS_IsException(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (JS_IsUndefined(*property) || JS_IsNull(*property)) {
        if (required) {
            JS_ThrowTypeError(ctx, "%s requires option '%s'", api_name, name);
            ok = false;
        }
    } else {
        *out_value = JS_ToCString(ctx, *property, out_buf);
        if (*out_value == NULL) {
            ok = false;
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    return ok;
}

static JSValue display_font_make(JSContext *ctx,
                                 const uint8_t *bytes,
                                 size_t length,
                                 const char *name)
{
    uint8_t first;
    uint8_t last;
    uint8_t width;
    uint8_t height;
    uint8_t bytes_per_column;
    uint8_t advance;
    uint8_t line_height;
    uint32_t glyph_length;
    size_t glyph_count;
    size_t glyph_stride;
    esp32_mquickjs_display_font_t *font = NULL;
    JSGCRef object_ref;
    JSValue *object;

    if (bytes == NULL || length < DISPLAY_FONT_HEADER_SIZE) {
        return JS_ThrowTypeError(ctx, "displayBuffer.loadFont(path) found an invalid font file");
    }
    if (bytes[0] != DISPLAY_FONT_MAGIC0 || bytes[1] != DISPLAY_FONT_MAGIC1 ||
        bytes[2] != DISPLAY_FONT_MAGIC2 || bytes[3] != DISPLAY_FONT_MAGIC3 ||
        bytes[4] != DISPLAY_FONT_FORMAT_BITMAP_FIXED || bytes[5] != 0) {
        return JS_ThrowTypeError(ctx, "displayBuffer.loadFont(path) expects EQF1 bitmap-fixed font data");
    }

    first = bytes[6];
    last = bytes[7];
    width = bytes[8];
    height = bytes[9];
    advance = bytes[10];
    line_height = bytes[11];
    glyph_length = read_u32_le(bytes + 12);
    if (last < first || width == 0 || height == 0 || height > 64 ||
        advance == 0 || line_height == 0 || line_height < height) {
        return JS_ThrowTypeError(ctx, "displayBuffer.loadFont(path) found invalid font metrics");
    }

    bytes_per_column = (uint8_t)((height + 7U) / 8U);
    glyph_count = (size_t)last - (size_t)first + 1U;
    glyph_stride = (size_t)width * bytes_per_column;
    if (glyph_stride == 0 || glyph_count > SIZE_MAX / glyph_stride ||
        glyph_length != glyph_count * glyph_stride ||
        (size_t)glyph_length > length - DISPLAY_FONT_HEADER_SIZE) {
        return JS_ThrowTypeError(ctx, "displayBuffer.loadFont(path) found invalid glyph data length");
    }

    font = heap_caps_malloc(sizeof(*font), MALLOC_CAP_8BIT);
    if (font == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    memset(font, 0, sizeof(*font));
    font->name = display_font_copy_name(name);
    font->glyphs = heap_caps_malloc(glyph_length == 0 ? 1U : (size_t)glyph_length, MALLOC_CAP_8BIT);
    if (font->name == NULL || font->glyphs == NULL) {
        display_font_free(font);
        return JS_ThrowOutOfMemory(ctx);
    }
    memcpy(font->glyphs, bytes + DISPLAY_FONT_HEADER_SIZE, glyph_length);
    font->font.name = font->name;
    font->font.glyphs = font->glyphs;
    font->font.first = first;
    font->font.last = last;
    font->font.width = width;
    font->font.height = height;
    font->font.bytes_per_column = bytes_per_column;
    font->font.advance = advance;
    font->font.line_height = line_height;

    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_DISPLAY_FONT);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        display_font_free(font);
        return JS_EXCEPTION;
    }
    JS_SetOpaque(ctx, *object, font);
    return JS_PopGCRef(ctx, &object_ref);
}

#if CONFIG_ESP32_MQUICKJS_FEATURE_FS
static uint8_t *display_font_read_file(JSContext *ctx,
                                       const char *script_path,
                                       char *resolved_path,
                                       size_t resolved_path_size,
                                       size_t *out_length)
{
    FILE *file;
    long file_size;
    uint8_t *bytes;
    size_t read_len;

