99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer.c
    if (!esp32_mquickjs_fs_resolve_path(ESP32_MQUICKJS_LITTLEFS_BASE_PATH,
                                        script_path,
                                        resolved_path,
                                        resolved_path_size)) {
        JS_ThrowTypeError(ctx, "displayBuffer.loadFont(path) expects a path under %s",
                          ESP32_MQUICKJS_LITTLEFS_BASE_PATH);
        return NULL;
    }

    file = fopen(resolved_path, "rb");
    if (file == NULL) {
        JS_ThrowReferenceError(ctx,
                               "displayBuffer.loadFont(path) failed for %s (%s)",
                               resolved_path,
                               strerror(errno));
        return NULL;
    }
    if (fseek(file, 0, SEEK_END) != 0) {
        fclose(file);
        JS_ThrowInternalError(ctx, "displayBuffer.loadFont(path) failed to seek %s", resolved_path);
        return NULL;
    }
    file_size = ftell(file);
    if (file_size < 0 || fseek(file, 0, SEEK_SET) != 0) {
        fclose(file);
        JS_ThrowInternalError(ctx, "displayBuffer.loadFont(path) failed to size %s", resolved_path);
        return NULL;
    }
    if (file_size < (long)DISPLAY_FONT_HEADER_SIZE) {
        fclose(file);
        JS_ThrowTypeError(ctx, "displayBuffer.loadFont(path) found a truncated font file: %s", resolved_path);
        return NULL;
    }

    bytes = heap_caps_malloc((size_t)file_size, MALLOC_CAP_8BIT);
    if (bytes == NULL) {
        fclose(file);
        JS_ThrowOutOfMemory(ctx);
        return NULL;
    }
    read_len = fread(bytes, 1, (size_t)file_size, file);
    fclose(file);
    if (read_len != (size_t)file_size) {
        heap_caps_free(bytes);
        JS_ThrowInternalError(ctx, "displayBuffer.loadFont(path) failed to read %s", resolved_path);
        return NULL;
    }

    *out_length = read_len;
    return bytes;
}
#endif

static bool parse_format(const char *name, uint8_t *out_format)
{
    if (string_equals(name, "mono1")) {
        *out_format = DISPLAY_BUFFER_FORMAT_MONO1;
        return true;
    }
    if (string_equals(name, "rgb565") || string_equals(name, "rgb565be") || string_equals(name, "rgb565le")) {
        *out_format = DISPLAY_BUFFER_FORMAT_RGB565;
        return true;
    }
    return false;
}

static bool parse_layout(const char *name, uint8_t format, uint8_t *out_layout)
{
    if (name == NULL) {
        *out_layout = format == DISPLAY_BUFFER_FORMAT_MONO1 ? DISPLAY_BUFFER_LAYOUT_PAGE_Y8
                                                            : DISPLAY_BUFFER_LAYOUT_LINEAR;
        return true;
    }
    if (string_equals(name, "linear")) {
        *out_layout = DISPLAY_BUFFER_LAYOUT_LINEAR;
        return true;
    }
    if (string_equals(name, "page-y8")) {
        *out_layout = DISPLAY_BUFFER_LAYOUT_PAGE_Y8;
        return true;
    }
    return false;
}

static bool parse_storage(const char *name, uint8_t *out_storage)
{
    if (name == NULL || string_equals(name, "auto")) {
        *out_storage = DISPLAY_BUFFER_STORAGE_AUTO;
        return true;
    }
    if (string_equals(name, "internal")) {
        *out_storage = DISPLAY_BUFFER_STORAGE_INTERNAL;
        return true;
    }
    if (string_equals(name, "psram")) {
        *out_storage = DISPLAY_BUFFER_STORAGE_PSRAM;
        return true;
    }
    if (string_equals(name, "dma")) {
        *out_storage = DISPLAY_BUFFER_STORAGE_DMA;
        return true;
    }
    return false;
}

static bool compute_layout(uint32_t width,
                           uint32_t height,
                           uint8_t format,
                           uint8_t layout,
                           uint32_t requested_stride,
                           uint32_t requested_page_height,
                           uint16_t *out_stride,
                           uint16_t *out_page_height,
                           size_t *out_byte_length)
{
    uint32_t min_stride = 0;
    uint32_t page_height = 1;
    size_t rows = height;
    size_t byte_length;

    if (width == 0 || height == 0 ||
        width > DISPLAY_BUFFER_MAX_DIMENSION || height > DISPLAY_BUFFER_MAX_DIMENSION) {
        return false;
    }

    if (format == DISPLAY_BUFFER_FORMAT_RGB565) {
        if (layout != DISPLAY_BUFFER_LAYOUT_LINEAR) {
            return false;
        }
        min_stride = width * 2U;
        page_height = 1;
        rows = height;
    } else if (layout == DISPLAY_BUFFER_LAYOUT_PAGE_Y8) {
        min_stride = width;
        page_height = requested_page_height == 0 ? 8U : requested_page_height;
        if (page_height != 8U) {
            return false;
        }
        rows = (height + 7U) / 8U;
    } else {
        min_stride = (width + 7U) / 8U;
        page_height = 1;
        rows = height;
    }

    if (requested_stride != 0) {
        if (requested_stride < min_stride || requested_stride > UINT16_MAX) {
            return false;
        }
        min_stride = requested_stride;
    }
    if (min_stride > UINT16_MAX || page_height > UINT16_MAX) {
        return false;
    }
    byte_length = rows * (size_t)min_stride;
    if (byte_length == 0 || byte_length > SIZE_MAX / 2U) {
        return false;
    }

    *out_stride = (uint16_t)min_stride;
    *out_page_height = (uint16_t)page_height;
    *out_byte_length = byte_length;
    return true;
}

static uint32_t allocation_caps(uint8_t storage, size_t byte_length)
{
    if (storage == DISPLAY_BUFFER_STORAGE_INTERNAL) {
        return MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT;
    }
    if (storage == DISPLAY_BUFFER_STORAGE_PSRAM) {
        return MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT;
    }
    if (storage == DISPLAY_BUFFER_STORAGE_DMA) {
        return MALLOC_CAP_DMA | MALLOC_CAP_8BIT;
    }

#ifdef CONFIG_SPIRAM
    if (byte_length > DISPLAY_BUFFER_SMALL_INTERNAL_LIMIT && esp_psram_is_initialized()) {
        return MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT;
    }
#else
    (void)byte_length;
#endif
    return MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT;
}

static uint8_t *alloc_export_bytes(size_t length)
{
    uint8_t *data = heap_caps_malloc(length, MALLOC_CAP_DMA | MALLOC_CAP_8BIT);

    if (data != NULL) {
        return data;
    }
    return heap_caps_malloc(length, MALLOC_CAP_8BIT);
}

static uint8_t *ensure_export_chunk(esp32_mquickjs_display_buffer_t *buffer, size_t length)
{
    size_t capacity = length == 0 ? 1U : length;
    uint8_t *chunk;

    if (buffer->chunk != NULL && buffer->chunk_capacity >= capacity) {
        return buffer->chunk;
    }

    chunk = alloc_export_bytes(capacity);
    if (chunk == NULL) {
        return NULL;
    }
    heap_caps_free(buffer->chunk);
    buffer->chunk = chunk;
    buffer->chunk_capacity = capacity;
    return buffer->chunk;
}

static esp32_mquickjs_display_buffer_t *display_buffer_from_value(JSContext *ctx,
                                                                  JSValue value,
                                                                  const char *api_name)
{
    esp32_mquickjs_display_buffer_t *buffer;

