99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer.c
    if (JS_GetClassID(ctx, value) != JS_CLASS_DISPLAY_BUFFER) {
        JS_ThrowTypeError(ctx, "%s expects a DisplayBuffer", api_name);
        return NULL;
    }
    buffer = JS_GetOpaque(ctx, value);
    if (buffer == NULL || buffer->closed) {
        JS_ThrowReferenceError(ctx, "%s failed because the DisplayBuffer is closed", api_name);
        return NULL;
    }
    return buffer;
}

static void clear_dirty(esp32_mquickjs_display_buffer_t *buffer)
{
    buffer->dirty_x0 = 0;
    buffer->dirty_y0 = 0;
    buffer->dirty_x1 = 0;
    buffer->dirty_y1 = 0;
}

static void mark_dirty(esp32_mquickjs_display_buffer_t *buffer, int x, int y, int width, int height)
{
    int x1;
    int y1;

    if (buffer == NULL || width <= 0 || height <= 0) {
        return;
    }
    if (x < 0) {
        width += x;
        x = 0;
    }
    if (y < 0) {
        height += y;
        y = 0;
    }
    if (x >= buffer->width || y >= buffer->height || width <= 0 || height <= 0) {
        return;
    }
    if (x + width > buffer->width) {
        width = buffer->width - x;
    }
    if (y + height > buffer->height) {
        height = buffer->height - y;
    }
    x1 = x + width;
    y1 = y + height;

    if (buffer->dirty_x1 <= buffer->dirty_x0 || buffer->dirty_y1 <= buffer->dirty_y0) {
        buffer->dirty_x0 = x;
        buffer->dirty_y0 = y;
        buffer->dirty_x1 = x1;
        buffer->dirty_y1 = y1;
        return;
    }
    if (x < buffer->dirty_x0) {
        buffer->dirty_x0 = x;
    }
    if (y < buffer->dirty_y0) {
        buffer->dirty_y0 = y;
    }
    if (x1 > buffer->dirty_x1) {
        buffer->dirty_x1 = x1;
    }
    if (y1 > buffer->dirty_y1) {
        buffer->dirty_y1 = y1;
    }
}

static size_t pixel_offset(const esp32_mquickjs_display_buffer_t *buffer, int x, int y)
{
    if (buffer->format == DISPLAY_BUFFER_FORMAT_RGB565) {
        return (size_t)y * buffer->stride + ((size_t)x * 2U);
    }
    if (buffer->layout == DISPLAY_BUFFER_LAYOUT_PAGE_Y8) {
        return ((size_t)y >> 3U) * buffer->stride + (size_t)x;
    }
    return (size_t)y * buffer->stride + ((size_t)x >> 3U);
}

static void set_pixel_raw(esp32_mquickjs_display_buffer_t *buffer, int x, int y, uint16_t color)
{
    size_t offset;
    uint8_t mask;

    if (x < 0 || y < 0 || x >= buffer->width || y >= buffer->height) {
        return;
    }

    offset = pixel_offset(buffer, x, y);
    if (buffer->format == DISPLAY_BUFFER_FORMAT_RGB565) {
        buffer->data[offset] = (uint8_t)((color >> 8U) & 0xffU);
        buffer->data[offset + 1U] = (uint8_t)(color & 0xffU);
        return;
    }

    mask = buffer->layout == DISPLAY_BUFFER_LAYOUT_PAGE_Y8 ? (uint8_t)(1U << (y & 7))
                                                           : (uint8_t)(1U << (x & 7));
    if (color != 0) {
        buffer->data[offset] |= mask;
    } else {
        buffer->data[offset] &= (uint8_t)~mask;
    }
}

static uint16_t get_pixel_raw(const esp32_mquickjs_display_buffer_t *buffer, int x, int y)
{
    size_t offset;
    uint8_t mask;

    if (x < 0 || y < 0 || x >= buffer->width || y >= buffer->height) {
        return 0;
    }

    offset = pixel_offset(buffer, x, y);
    if (buffer->format == DISPLAY_BUFFER_FORMAT_RGB565) {
        return (uint16_t)(((uint16_t)buffer->data[offset] << 8U) | buffer->data[offset + 1U]);
    }

    mask = buffer->layout == DISPLAY_BUFFER_LAYOUT_PAGE_Y8 ? (uint8_t)(1U << (y & 7))
                                                           : (uint8_t)(1U << (x & 7));
    return (buffer->data[offset] & mask) != 0 ? 1U : 0U;
}

static void fill_rect_raw(esp32_mquickjs_display_buffer_t *buffer,
                          int x,
                          int y,
                          int width,
                          int height,
                          uint16_t color,
                          bool update_dirty)
{
    int x0 = x;
    int y0 = y;
    int x1 = x + width;
    int y1 = y + height;
    int yy;

    if (width <= 0 || height <= 0) {
        return;
    }
    if (x0 < 0) {
        x0 = 0;
    }
    if (y0 < 0) {
        y0 = 0;
    }
    if (x1 > buffer->width) {
        x1 = buffer->width;
    }
    if (y1 > buffer->height) {
        y1 = buffer->height;
    }
    if (x1 <= x0 || y1 <= y0) {
        return;
    }

    if (buffer->format == DISPLAY_BUFFER_FORMAT_RGB565) {
        uint8_t high = (uint8_t)((color >> 8U) & 0xffU);
        uint8_t low = (uint8_t)(color & 0xffU);
        for (yy = y0; yy < y1; ++yy) {
            size_t offset = pixel_offset(buffer, x0, yy);
            int xx;

            for (xx = x0; xx < x1; ++xx) {
                buffer->data[offset++] = high;
                buffer->data[offset++] = low;
            }
        }
    } else {
        int xx;

        for (yy = y0; yy < y1; ++yy) {
            for (xx = x0; xx < x1; ++xx) {
                set_pixel_raw(buffer, xx, yy, color);
            }
        }
    }

    if (update_dirty) {
        mark_dirty(buffer, x0, y0, x1 - x0, y1 - y0);
    }
}

static void draw_line_raw(esp32_mquickjs_display_buffer_t *buffer,
                          int x0,
                          int y0,
                          int x1,
                          int y1,
                          uint16_t color)
{
    int dx = x1 >= x0 ? x1 - x0 : x0 - x1;
    int sx = x0 < x1 ? 1 : -1;
    int dy_abs = y1 >= y0 ? y1 - y0 : y0 - y1;
    int dy = -dy_abs;
    int sy = y0 < y1 ? 1 : -1;
    int err = dx + dy;

    while (true) {
        int e2;

        set_pixel_raw(buffer, x0, y0, color);
        if (x0 == x1 && y0 == y1) {
            break;
        }
        e2 = err << 1;
        if (e2 >= dy) {
            err += dy;
            x0 += sx;
        }
        if (e2 <= dx) {
            err += dx;
            y0 += sy;
        }
    }
}

static int text_spacing_from_options(JSContext *ctx, JSValue options, int default_spacing)
{
    JSGCRef property_ref;
    JSValue *property;
    int32_t spacing = default_spacing;

    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return default_spacing;
    }
    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, options, "spacing");
    if (!JS_IsException(*property) && !JS_IsUndefined(*property) && !JS_IsNull(*property)) {
        if (!value_to_i32(ctx, *property, &spacing)) {
            spacing = default_spacing;
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    if (spacing < 0) {
        spacing = 0;
    }
    if (spacing > 32) {
        spacing = 32;
    }
    return (int)spacing;
}

