99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer.c
static const esp32_mquickjs_bitmap_font_t *text_font_from_options(JSContext *ctx,
                                                                  JSValue options,
                                                                  const char *api_name,
                                                                  bool *ok)
{
    JSGCRef property_ref;
    JSValue *property;
    esp32_mquickjs_display_font_t *font;

    *ok = true;
    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        JS_ThrowTypeError(ctx, "%s requires a DisplayFont", api_name);
        *ok = false;
        return NULL;
    }
    if (JS_GetClassID(ctx, options) == JS_CLASS_DISPLAY_FONT) {
        font = display_font_from_value(ctx, options, api_name);
        if (font == NULL) {
            *ok = false;
            return NULL;
        }
        return &font->font;
    }

    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, options, "font");
    if (JS_IsException(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        *ok = false;
        return NULL;
    }
    if (JS_IsUndefined(*property) || JS_IsNull(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        JS_ThrowTypeError(ctx, "%s requires a DisplayFont", api_name);
        *ok = false;
        return NULL;
    }
    font = display_font_from_value(ctx, *property, api_name);
    JS_PopGCRef(ctx, &property_ref);
    if (font == NULL) {
        *ok = false;
        return NULL;
    }
    return &font->font;
}

static bool rect_from_args(JSContext *ctx,
                           int argc,
                           JSValue *argv,
                           int32_t *x,
                           int32_t *y,
                           int32_t *width,
                           int32_t *height,
                           const char *api_name)
{
    if (argc < 4 ||
        !value_to_i32(ctx, argv[0], x) ||
        !value_to_i32(ctx, argv[1], y) ||
        !value_to_i32(ctx, argv[2], width) ||
        !value_to_i32(ctx, argv[3], height)) {
        JS_ThrowTypeError(ctx, "%s expects x, y, width, and height integers", api_name);
        return false;
    }
    return true;
}

static bool rect_clamp(const esp32_mquickjs_display_buffer_t *buffer,
                       int *x,
                       int *y,
                       int *width,
                       int *height)
{
    int x1 = *x + *width;
    int y1 = *y + *height;

    if (*width <= 0 || *height <= 0) {
        return false;
    }
    if (*x < 0) {
        *x = 0;
    }
    if (*y < 0) {
        *y = 0;
    }
    if (x1 > buffer->width) {
        x1 = buffer->width;
    }
    if (y1 > buffer->height) {
        y1 = buffer->height;
    }
    *width = x1 - *x;
    *height = y1 - *y;
    return *width > 0 && *height > 0;
}

static bool read_rect_options(JSContext *ctx, JSValue options, bool *out_little_endian, uint32_t *out_chunk_bytes)
{
    JSGCRef property_ref;
    JSValue *property;
    bool ok = true;

    *out_little_endian = false;
    if (out_chunk_bytes != NULL) {
        *out_chunk_bytes = 0;
    }
    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return true;
    }
    if (JS_GetClassID(ctx, options) < 0) {
        JS_ThrowTypeError(ctx, "readRect options must be an object");
        return false;
    }

    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, options, "byteOrder");
    if (JS_IsException(*property)) {
        ok = false;
        goto done;
    }
    if (!JS_IsUndefined(*property) && !JS_IsNull(*property)) {
        JSCStringBuf order_buf;
        const char *order = JS_ToCString(ctx, *property, &order_buf);

        if (order == NULL) {
            ok = false;
            goto done;
        }
        if (string_equals(order, "le") || string_equals(order, "rgb565le")) {
            *out_little_endian = true;
        } else if (!string_equals(order, "be") && !string_equals(order, "rgb565be")) {
            JS_ThrowTypeError(ctx, "readRect option 'byteOrder' expects 'be' or 'le'");
            ok = false;
            goto done;
        }
    }

    if (out_chunk_bytes != NULL) {
        *property = JS_GetPropertyStr(ctx, options, "chunkBytes");
        if (JS_IsException(*property)) {
            ok = false;
            goto done;
        }
        if (!JS_IsUndefined(*property) && !JS_IsNull(*property) &&
            (!value_to_u32(ctx, *property, out_chunk_bytes) || *out_chunk_bytes == 0)) {
            JS_ThrowTypeError(ctx, "readRectChunks option 'chunkBytes' expects a positive integer");
            ok = false;
            goto done;
        }
    }

done:
    JS_PopGCRef(ctx, &property_ref);
    return ok;
}

static size_t read_rect_length(const esp32_mquickjs_display_buffer_t *buffer, int width, int height)
{
    if (buffer->format == DISPLAY_BUFFER_FORMAT_RGB565) {
        return (size_t)width * (size_t)height * 2U;
    }
    if (buffer->layout == DISPLAY_BUFFER_LAYOUT_PAGE_Y8) {
        return (((size_t)height + 7U) / 8U) * (size_t)width;
    }
    return (((size_t)width + 7U) / 8U) * (size_t)height;
}

static void read_rect_fill(const esp32_mquickjs_display_buffer_t *buffer,
                           int x,
                           int y,
                           int width,
                           int height,
                           bool little_endian,
                           uint8_t *out)
{
    int yy;

    if (buffer->format == DISPLAY_BUFFER_FORMAT_RGB565) {
        size_t out_offset = 0;

        for (yy = y; yy < y + height; ++yy) {
            int xx;

            for (xx = x; xx < x + width; ++xx) {
                uint16_t color = get_pixel_raw(buffer, xx, yy);

                if (little_endian) {
                    out[out_offset++] = (uint8_t)(color & 0xffU);
                    out[out_offset++] = (uint8_t)((color >> 8U) & 0xffU);
                } else {
                    out[out_offset++] = (uint8_t)((color >> 8U) & 0xffU);
                    out[out_offset++] = (uint8_t)(color & 0xffU);
                }
            }
        }
        return;
    }

    if (buffer->layout == DISPLAY_BUFFER_LAYOUT_PAGE_Y8) {
        size_t length = read_rect_length(buffer, width, height);
        int local_y;

        memset(out, 0, length);
        for (local_y = 0; local_y < height; ++local_y) {
            int xx;

