99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer.c
            for (xx = 0; xx < width; ++xx) {
                if (get_pixel_raw(buffer, x + xx, y + local_y) != 0) {
                    out[((size_t)local_y >> 3U) * (size_t)width + (size_t)xx] |= (uint8_t)(1U << (local_y & 7));
                }
            }
        }
        return;
    }

    {
        size_t row_bytes = ((size_t)width + 7U) / 8U;
        size_t length = read_rect_length(buffer, width, height);
        int local_y;

        memset(out, 0, length);
        for (local_y = 0; local_y < height; ++local_y) {
            int xx;

            for (xx = 0; xx < width; ++xx) {
                if (get_pixel_raw(buffer, x + xx, y + local_y) != 0) {
                    out[(size_t)local_y * row_bytes + ((size_t)xx >> 3U)] |= (uint8_t)(1U << (xx & 7));
                }
            }
        }
    }
}

static uint8_t *read_rect_alloc(const esp32_mquickjs_display_buffer_t *buffer,
                                int x,
                                int y,
                                int width,
                                int height,
                                bool little_endian,
                                size_t *out_length)
{
    uint8_t *out;
    size_t length;

    if (!rect_clamp(buffer, &x, &y, &width, &height)) {
        *out_length = 0;
        return NULL;
    }

    length = read_rect_length(buffer, width, height);
    out = alloc_export_bytes(length);
    if (out == NULL) {
        *out_length = 0;
        return NULL;
    }
    read_rect_fill(buffer, x, y, width, height, little_endian, out);
    *out_length = length;
    return out;
}

static JSValue make_staged_rect_byte_view(JSContext *ctx,
                                          JSValue owner,
                                          esp32_mquickjs_display_buffer_t *buffer,
                                          int x,
                                          int y,
                                          int width,
                                          int height,
                                          bool little_endian)
{
    uint8_t *data;
    size_t length = 0;
    JSValue staged_view;

    if (rect_clamp(buffer, &x, &y, &width, &height)) {
        length = read_rect_length(buffer, width, height);
    }

    data = ensure_export_chunk(buffer, length);
    if (data == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    if (length > 0) {
        read_rect_fill(buffer, x, y, width, height, little_endian, data);
    }

    staged_view = JS_GetPropertyStr(ctx, owner, DISPLAY_BUFFER_STAGED_VIEW_KEY);
    if (JS_IsException(staged_view)) {
        return JS_EXCEPTION;
    }
    if (JS_GetClassID(ctx, staged_view) == JS_CLASS_BYTE_VIEW) {
        if (!esp32_mquickjs_update_byte_view(ctx, staged_view, data, length)) {
            return JS_EXCEPTION;
        }
        return staged_view;
    }

    {
        JSGCRef staged_ref;
        JSValue *staged_obj = JS_PushGCRef(ctx, &staged_ref);

        *staged_obj = esp32_mquickjs_new_byte_view(ctx, owner, data, length);
        if (JS_IsException(*staged_obj)) {
            JS_PopGCRef(ctx, &staged_ref);
            return JS_EXCEPTION;
        }
        if (JS_IsException(JS_SetPropertyStr(ctx, owner, DISPLAY_BUFFER_STAGED_VIEW_KEY, *staged_obj))) {
            JS_PopGCRef(ctx, &staged_ref);
            return JS_EXCEPTION;
        }
        return JS_PopGCRef(ctx, &staged_ref);
    }
}

static JSValue make_owned_rect_byte_view(JSContext *ctx,
                                         const esp32_mquickjs_display_buffer_t *buffer,
                                         int x,
                                         int y,
                                         int width,
                                         int height,
                                         bool little_endian)
{
    int clamped_x = x;
    int clamped_y = y;
    int clamped_width = width;
    int clamped_height = height;
    uint8_t *data;
    size_t length = 0;

    if (!rect_clamp(buffer, &clamped_x, &clamped_y, &clamped_width, &clamped_height)) {
        data = alloc_export_bytes(1);
        if (data == NULL) {
            return JS_ThrowOutOfMemory(ctx);
        }
        return esp32_mquickjs_new_owned_byte_view(ctx, data, 0);
    }

    data = read_rect_alloc(buffer, clamped_x, clamped_y, clamped_width, clamped_height, little_endian, &length);
    if (data == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    return esp32_mquickjs_new_owned_byte_view(ctx, data, length);
}

JSValue js_display_buffer_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "DisplayBuffer cannot be constructed directly; use displayBuffer.create(options)");
}

JSValue js_display_font_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "DisplayFont cannot be constructed directly; use displayBuffer.loadFont(path)");
}

void js_display_buffer_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_display_buffer_t *buffer = opaque;

    (void)ctx;

    if (buffer == NULL) {
        return;
    }
    heap_caps_free(buffer->data);
    heap_caps_free(buffer->chunk);
    heap_caps_free(buffer);
}

void js_display_font_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    display_font_free(opaque);
}

JSValue js_display_font_get_name(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_font_t *font;

    (void)argc;
    (void)argv;
    font = display_font_from_value(ctx, *this_val, "DisplayFont.name");
    if (font == NULL) {
        return JS_EXCEPTION;
    }
    return JS_NewString(ctx, font->name != NULL ? font->name : "");
}

JSValue js_display_font_get_width(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_font_t *font;

    (void)argc;
    (void)argv;
    font = display_font_from_value(ctx, *this_val, "DisplayFont.width");
    return font == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, font->font.width);
}

JSValue js_display_font_get_height(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_font_t *font;

    (void)argc;
    (void)argv;
    font = display_font_from_value(ctx, *this_val, "DisplayFont.height");
    return font == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, font->font.height);
}

JSValue js_display_font_get_advance(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_font_t *font;

    (void)argc;
    (void)argv;
    font = display_font_from_value(ctx, *this_val, "DisplayFont.advance");
    return font == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, font->font.advance);
}

