99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer.c
JSValue js_display_font_get_line_height(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_font_t *font;

    (void)argc;
    (void)argv;
    font = display_font_from_value(ctx, *this_val, "DisplayFont.lineHeight");
    return font == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, font->font.line_height);
}

JSValue js_display_buffer_create(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSCStringBuf format_buf;
    JSCStringBuf layout_buf;
    JSCStringBuf storage_buf;
    const char *format_name_value = NULL;
    const char *layout_name_value = NULL;
    const char *storage_name_value = NULL;
    uint32_t width = 0;
    uint32_t height = 0;
    uint32_t stride = 0;
    uint32_t page_height = 0;
    uint32_t chunk_bytes = DISPLAY_BUFFER_DEFAULT_CHUNK_BYTES;
    uint8_t format;
    uint8_t layout;
    uint8_t storage;
    uint16_t computed_stride;
    uint16_t computed_page_height;
    size_t byte_length = 0;
    uint16_t foreground;
    uint16_t background;
    uint8_t *data;
    esp32_mquickjs_display_buffer_t *buffer;
    JSGCRef object_ref;
    JSValue *object;
    bool ok;

    (void)this_val;

    if (argc < 1 || JS_IsUndefined(argv[0]) || JS_IsNull(argv[0]) || JS_GetClassID(ctx, argv[0]) < 0) {
        return JS_ThrowTypeError(ctx, "displayBuffer.create(options) expects an options object");
    }
    if (!get_u32_option(ctx, argv[0], "width", &width, true, "displayBuffer.create()") ||
        !get_u32_option(ctx, argv[0], "height", &height, true, "displayBuffer.create()") ||
        !get_string_option(ctx, argv[0], "format", &format_name_value, &format_buf, true, "displayBuffer.create()")) {
        return JS_EXCEPTION;
    }
    if (!parse_format(format_name_value, &format)) {
        return JS_ThrowTypeError(ctx, "displayBuffer.create({ format }) expects 'mono1' or 'rgb565'");
    }
    if (!get_string_option(ctx, argv[0], "layout", &layout_name_value, &layout_buf, false, "displayBuffer.create()") ||
        !get_string_option(ctx, argv[0], "storage", &storage_name_value, &storage_buf, false, "displayBuffer.create()") ||
        !get_u32_option(ctx, argv[0], "stride", &stride, false, "displayBuffer.create()") ||
        !get_u32_option(ctx, argv[0], "pageHeight", &page_height, false, "displayBuffer.create()") ||
        !get_u32_option(ctx, argv[0], "chunkBytes", &chunk_bytes, false, "displayBuffer.create()")) {
        return JS_EXCEPTION;
    }
    if (chunk_bytes == 0) {
        chunk_bytes = DISPLAY_BUFFER_DEFAULT_CHUNK_BYTES;
    }
    if (!parse_layout(layout_name_value, format, &layout)) {
        return JS_ThrowTypeError(ctx, "displayBuffer.create({ layout }) expects 'linear' or 'page-y8'");
    }
    if (!parse_storage(storage_name_value, &storage)) {
        return JS_ThrowTypeError(ctx, "displayBuffer.create({ storage }) expects 'auto', 'internal', 'psram', or 'dma'");
    }
    if (!compute_layout(width,
                        height,
                        format,
                        layout,
                        stride,
                        page_height,
                        &computed_stride,
                        &computed_page_height,
                        &byte_length)) {
        return JS_ThrowRangeError(ctx, "displayBuffer.create() received invalid dimensions, layout, pageHeight, or stride");
    }

    foreground = format == DISPLAY_BUFFER_FORMAT_MONO1 ? 1U : 0xffffU;
    background = 0U;
    {
        JSGCRef property_ref;
        JSValue *property = JS_PushGCRef(ctx, &property_ref);

        *property = JS_GetPropertyStr(ctx, argv[0], "foreground");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        foreground = normalize_color(ctx, format, *property, foreground, &ok);
        if (!ok) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "displayBuffer.create({ foreground }) expects a valid color");
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "background");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        background = normalize_color(ctx, format, *property, background, &ok);
        if (!ok) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "displayBuffer.create({ background }) expects a valid color");
        }
        JS_PopGCRef(ctx, &property_ref);
    }

    data = heap_caps_malloc(byte_length, allocation_caps(storage, byte_length));
    if (data == NULL && storage == DISPLAY_BUFFER_STORAGE_AUTO) {
        data = heap_caps_malloc(byte_length, MALLOC_CAP_8BIT);
    }
    if (data == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }

    buffer = heap_caps_malloc(sizeof(*buffer), MALLOC_CAP_8BIT);
    if (buffer == NULL) {
        heap_caps_free(data);
        return JS_ThrowOutOfMemory(ctx);
    }
    memset(buffer, 0, sizeof(*buffer));
    buffer->width = (uint16_t)width;
    buffer->height = (uint16_t)height;
    buffer->stride = computed_stride;
    buffer->page_height = computed_page_height;
    buffer->format = format;
    buffer->layout = layout;
    buffer->storage = storage;
    buffer->byte_length = byte_length;
    buffer->data = data;
    buffer->chunk_size = chunk_bytes;
    buffer->foreground = foreground;
    buffer->background = background;
    clear_dirty(buffer);
    fill_rect_raw(buffer, 0, 0, buffer->width, buffer->height, background, false);

    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_DISPLAY_BUFFER);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        heap_caps_free(buffer->data);
        heap_caps_free(buffer);
        return JS_EXCEPTION;
    }
    JS_SetOpaque(ctx, *object, buffer);
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_display_buffer_load_font(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;

    if (argc < 1 || !JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "displayBuffer.loadFont(path) expects a font path");
    }

#if CONFIG_ESP32_MQUICKJS_FEATURE_FS
    {
        JSCStringBuf path_buf;
        const char *path;
        char resolved_path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
        uint8_t *bytes;
        size_t length = 0;
        JSValue result;

