99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer.c
        path = JS_ToCString(ctx, argv[0], &path_buf);
        if (path == NULL) {
            return JS_EXCEPTION;
        }
        bytes = display_font_read_file(ctx, path, resolved_path, sizeof(resolved_path), &length);
        if (bytes == NULL) {
            return JS_EXCEPTION;
        }
        result = display_font_make(ctx, bytes, length, esp32_mquickjs_fs_path_basename(resolved_path));
        heap_caps_free(bytes);
        return result;
    }
#else
    return JS_ThrowInternalError(ctx, "displayBuffer.loadFont(path) requires the fs feature");
#endif
}

JSValue js_display_buffer_get_width(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;

    (void)argc;
    (void)argv;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.width");
    return buffer == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, buffer->width);
}

JSValue js_display_buffer_get_height(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;

    (void)argc;
    (void)argv;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.height");
    return buffer == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, buffer->height);
}

JSValue js_display_buffer_get_format(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;

    (void)argc;
    (void)argv;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.format");
    return buffer == NULL ? JS_EXCEPTION : JS_NewString(ctx, format_name(buffer->format));
}

JSValue js_display_buffer_get_layout(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;

    (void)argc;
    (void)argv;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.layout");
    return buffer == NULL ? JS_EXCEPTION : JS_NewString(ctx, layout_name(buffer->layout));
}

JSValue js_display_buffer_get_stride(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;

    (void)argc;
    (void)argv;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.stride");
    return buffer == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, buffer->stride);
}

JSValue js_display_buffer_get_page_height(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;

    (void)argc;
    (void)argv;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.pageHeight");
    return buffer == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, buffer->page_height);
}

JSValue js_display_buffer_get_byte_length(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;

    (void)argc;
    (void)argv;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.byteLength");
    return buffer == NULL ? JS_EXCEPTION : JS_NewUint32(ctx, (uint32_t)buffer->byte_length);
}

JSValue js_display_buffer_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;

    (void)argc;
    (void)argv;

    if (JS_GetClassID(ctx, *this_val) != JS_CLASS_DISPLAY_BUFFER) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.close() expects a DisplayBuffer");
    }
    buffer = JS_GetOpaque(ctx, *this_val);
    if (buffer != NULL && !buffer->closed) {
        heap_caps_free(buffer->data);
        heap_caps_free(buffer->chunk);
        buffer->data = NULL;
        buffer->chunk = NULL;
        buffer->closed = 1;
    }
    return JS_TRUE;
}

JSValue js_display_buffer_clear(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.clear()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, buffer->format, argc >= 1 ? argv[0] : JS_UNDEFINED, buffer->background, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.clear(color?) expects a valid color");
    }
    fill_rect_raw(buffer, 0, 0, buffer->width, buffer->height, color, true);
    return *this_val;
}

JSValue js_display_buffer_set_pixel(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.setPixel()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 3 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y)) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.setPixel(x, y, color) expects x and y integers");
    }
    color = normalize_color(ctx, buffer->format, argv[2], buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.setPixel(x, y, color) expects a valid color");
    }
    set_pixel_raw(buffer, x, y, color);
    mark_dirty(buffer, x, y, 1, 1);
    return *this_val;
}

JSValue js_display_buffer_get_pixel(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    uint16_t color;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.getPixel()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 2 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y)) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.getPixel(x, y) expects x and y integers");
    }
    color = get_pixel_raw(buffer, x, y);
    return buffer->format == DISPLAY_BUFFER_FORMAT_MONO1 ? JS_NewBool(color != 0) : JS_NewUint32(ctx, color);
}

JSValue js_display_buffer_fill_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.fillRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "DisplayBuffer.fillRect()")) {
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.fillRect(x, y, width, height, color) expects a valid color");
    }
    fill_rect_raw(buffer, x, y, width, height, color, true);
    return *this_val;
}

