99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer.c
JSValue js_display_buffer_draw_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "DisplayBuffer.drawRect()")) {
        return JS_EXCEPTION;
    }
    if (width <= 0 || height <= 0) {
        return *this_val;
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawRect(x, y, width, height, color) expects a valid color");
    }
    draw_line_raw(buffer, x, y, x + width - 1, y, color);
    draw_line_raw(buffer, x, y + height - 1, x + width - 1, y + height - 1, color);
    draw_line_raw(buffer, x, y, x, y + height - 1, color);
    draw_line_raw(buffer, x + width - 1, y, x + width - 1, y + height - 1, color);
    mark_dirty(buffer, x, y, width, height);
    return *this_val;
}

JSValue js_display_buffer_draw_line(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x0;
    int32_t y0;
    int32_t x1;
    int32_t y1;
    uint16_t color;
    bool ok;
    int min_x;
    int min_y;
    int max_x;
    int max_y;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawLine()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 4 || !value_to_i32(ctx, argv[0], &x0) || !value_to_i32(ctx, argv[1], &y0) ||
        !value_to_i32(ctx, argv[2], &x1) || !value_to_i32(ctx, argv[3], &y1)) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawLine(x0, y0, x1, y1, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawLine(x0, y0, x1, y1, color) expects a valid color");
    }
    draw_line_raw(buffer, x0, y0, x1, y1, color);
    min_x = x0 < x1 ? x0 : x1;
    min_y = y0 < y1 ? y0 : y1;
    max_x = x0 > x1 ? x0 : x1;
    max_y = y0 > y1 ? y0 : y1;
    mark_dirty(buffer, min_x, min_y, max_x - min_x + 1, max_y - min_y + 1);
    return *this_val;
}

JSValue js_display_buffer_draw_text(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    uint16_t color;
    bool ok;
    JSCStringBuf text_buf;
    const char *text;
    int spacing;
    int cursor_x;
    int cursor_y;
    int measured_width;
    int measured_height;
    int measured_lines;
    const char *cursor;
    const esp32_mquickjs_bitmap_font_t *font;
    bool font_ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawText()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 3 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y)) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawText(x, y, text, color?, options?) expects x, y, and text");
    }
    text = JS_ToCString(ctx, argv[2], &text_buf);
    if (text == NULL) {
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, buffer->format, argc >= 4 ? argv[3] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawText(x, y, text, color?, options?) expects a valid color");
    }
    spacing = text_spacing_from_options(ctx, argc >= 5 ? argv[4] : JS_UNDEFINED, 0);
    font = text_font_from_options(ctx,
                                  argc >= 5 ? argv[4] : JS_UNDEFINED,
                                  "DisplayBuffer.drawText() option 'font'",
                                  &font_ok);
    if (!font_ok || font == NULL) {
        return JS_EXCEPTION;
    }
    cursor_x = x;
    cursor_y = y;
    for (cursor = text; *cursor != '\0'; ++cursor) {
        const uint8_t *glyph;
        int col;

        if (*cursor == '\n') {
            cursor_x = x;
            cursor_y += font->line_height;
            continue;
        }
        fill_rect_raw(buffer, cursor_x, cursor_y, font->advance + spacing, font->line_height, buffer->background, false);
        glyph = esp32_mquickjs_bitmap_font_glyph(font, *cursor);
        for (col = 0; col < font->width; ++col) {
            int row;

            for (row = 0; row < font->height; ++row) {
                uint8_t bits = glyph[((size_t)col * font->bytes_per_column) + ((size_t)row >> 3U)];

                if ((bits & (1U << (row & 7))) != 0) {
                    set_pixel_raw(buffer, cursor_x + col, cursor_y + row, color);
                }
            }
        }
        cursor_x += font->advance + spacing;
    }
    esp32_mquickjs_bitmap_font_measure(font, text, spacing, &measured_width, &measured_height, &measured_lines);
    (void)measured_lines;
    mark_dirty(buffer, x, y, measured_width, measured_height);
    return *this_val;
}

JSValue js_display_buffer_measure_text(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSCStringBuf text_buf;
    const char *text;
    int spacing;
    int width;
    int height;
    int lines;
    const esp32_mquickjs_bitmap_font_t *font;
    bool font_ok;
    JSGCRef object_ref;
    JSValue *object;

    (void)this_val;

    if (argc < 1) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.measureText(text, options?) expects text");
    }
    text = JS_ToCString(ctx, argv[0], &text_buf);
    if (text == NULL) {
        return JS_EXCEPTION;
    }
    spacing = text_spacing_from_options(ctx, argc >= 2 ? argv[1] : JS_UNDEFINED, 0);
    font = text_font_from_options(ctx,
                                  argc >= 2 ? argv[1] : JS_UNDEFINED,
                                  "DisplayBuffer.measureText() option 'font'",
                                  &font_ok);
    if (!font_ok || font == NULL) {
        return JS_EXCEPTION;
    }
    esp32_mquickjs_bitmap_font_measure(font, text, spacing, &width, &height, &lines);

    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    if (!esp32_mquickjs_set_property(ctx, *object, "width", JS_NewUint32(ctx, (uint32_t)width)) ||
        !esp32_mquickjs_set_property(ctx, *object, "height", JS_NewUint32(ctx, (uint32_t)height)) ||
        !esp32_mquickjs_set_property(ctx, *object, "lines", JS_NewUint32(ctx, (uint32_t)lines))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_display_buffer_get_dirty(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    JSGCRef object_ref;
    JSValue *object;

    (void)argc;
    (void)argv;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.getDirty()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (buffer->dirty_x1 <= buffer->dirty_x0 || buffer->dirty_y1 <= buffer->dirty_y0) {
        return JS_NULL;
    }
    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    if (!esp32_mquickjs_set_property(ctx, *object, "x", JS_NewInt32(ctx, buffer->dirty_x0)) ||
        !esp32_mquickjs_set_property(ctx, *object, "y", JS_NewInt32(ctx, buffer->dirty_y0)) ||
        !esp32_mquickjs_set_property(ctx, *object, "width", JS_NewInt32(ctx, buffer->dirty_x1 - buffer->dirty_x0)) ||
        !esp32_mquickjs_set_property(ctx, *object, "height", JS_NewInt32(ctx, buffer->dirty_y1 - buffer->dirty_y0))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_display_buffer_clear_dirty(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;

    (void)argc;
    (void)argv;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.clearDirty()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    clear_dirty(buffer);
    return *this_val;
}

JSValue js_display_buffer_mark_dirty(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.markDirty()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "DisplayBuffer.markDirty()")) {
        return JS_EXCEPTION;
    }
    mark_dirty(buffer, x, y, width, height);
    return *this_val;
}

