99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer.c
JSValue js_display_buffer_read_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    bool little_endian = false;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.readRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "DisplayBuffer.readRect()")) {
        return JS_EXCEPTION;
    }
    if (!read_rect_options(ctx, argc >= 5 ? argv[4] : JS_UNDEFINED, &little_endian, NULL)) {
        return JS_EXCEPTION;
    }
    return make_staged_rect_byte_view(ctx, *this_val, buffer, x, y, width, height, little_endian);
}

JSValue js_display_buffer_read_rect_chunks(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    bool little_endian = false;
    uint32_t chunk_bytes = 0;
    size_t row_bytes;
    int rows_per_chunk;
    int end_y;
    uint32_t index = 0;
    JSGCRef array_ref;
    JSValue *array;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.readRectChunks()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "DisplayBuffer.readRectChunks()")) {
        return JS_EXCEPTION;
    }
    if (!read_rect_options(ctx, argc >= 5 ? argv[4] : JS_UNDEFINED, &little_endian, &chunk_bytes)) {
        return JS_EXCEPTION;
    }
    {
        int clamped_x = x;
        int clamped_y = y;
        int clamped_width = width;
        int clamped_height = height;

        if (!rect_clamp(buffer, &clamped_x, &clamped_y, &clamped_width, &clamped_height)) {
            return JS_NewArray(ctx, 0);
        }
        x = clamped_x;
        y = clamped_y;
        width = clamped_width;
        height = clamped_height;
    }
    if (chunk_bytes == 0) {
        chunk_bytes = buffer->chunk_size > 0 ? (uint32_t)buffer->chunk_size : DISPLAY_BUFFER_DEFAULT_CHUNK_BYTES;
    }
    row_bytes = buffer->format == DISPLAY_BUFFER_FORMAT_RGB565 ? (size_t)width * 2U
                                                               : (buffer->layout == DISPLAY_BUFFER_LAYOUT_PAGE_Y8
                                                                      ? (size_t)width
                                                                      : (((size_t)width + 7U) / 8U));
    rows_per_chunk = row_bytes == 0 ? 1 : (int)(chunk_bytes / row_bytes);
    if (rows_per_chunk < 1) {
        rows_per_chunk = 1;
    }
    if (buffer->format == DISPLAY_BUFFER_FORMAT_MONO1 && buffer->layout == DISPLAY_BUFFER_LAYOUT_PAGE_Y8) {
        rows_per_chunk *= 8;
        if (rows_per_chunk < 8) {
            rows_per_chunk = 8;
        }
    }

    array = JS_PushGCRef(ctx, &array_ref);
    *array = JS_NewArray(ctx, 0);
    if (JS_IsException(*array)) {
        JS_PopGCRef(ctx, &array_ref);
        return JS_EXCEPTION;
    }

    end_y = y + height;
    while (y < end_y) {
        int rows = rows_per_chunk;
        JSValue chunk;

        if (rows > end_y - y) {
            rows = end_y - y;
        }
        chunk = make_owned_rect_byte_view(ctx, buffer, x, y, width, rows, little_endian);
        if (JS_IsException(chunk) || JS_IsException(JS_SetPropertyUint32(ctx, *array, index++, chunk))) {
            JS_PopGCRef(ctx, &array_ref);
            return JS_EXCEPTION;
        }
        y += rows;
    }
    return JS_PopGCRef(ctx, &array_ref);
}

JSValue js_display_buffer_draw_bitmap(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    uint32_t width = 0;
    uint32_t height = 0;
    JSGCRef property_ref;
    JSValue *property;
    JSValue pixels = JS_UNDEFINED;
    uint32_t index = 0;
    uint16_t color;
    bool ok;
    uint32_t row;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawBitmap()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 3 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y) ||
        JS_GetClassID(ctx, argv[2]) < 0) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawBitmap(x, y, bitmap, color?) expects a bitmap object");
    }
    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, argv[2], "width");
    if (JS_IsException(*property) || !value_to_u32(ctx, *property, &width)) {
        JS_PopGCRef(ctx, &property_ref);
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawBitmap() bitmap.width must be numeric");
    }
    *property = JS_GetPropertyStr(ctx, argv[2], "height");
    if (JS_IsException(*property) || !value_to_u32(ctx, *property, &height)) {
        JS_PopGCRef(ctx, &property_ref);
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawBitmap() bitmap.height must be numeric");
    }
    pixels = JS_GetPropertyStr(ctx, argv[2], "pixels");
    if (JS_IsException(pixels)) {
        JS_PopGCRef(ctx, &property_ref);
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, buffer->format, argc >= 4 ? argv[3] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        JS_PopGCRef(ctx, &property_ref);
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawBitmap() color must be valid");
    }
    for (row = 0; row < height; ++row) {
        uint32_t col;

        for (col = 0; col < width; ++col) {
            uint32_t enabled = 0;

            *property = JS_GetPropertyUint32(ctx, pixels, index++);
            if (JS_IsException(*property)) {
                JS_PopGCRef(ctx, &property_ref);
                return JS_EXCEPTION;
            }
            if (!JS_IsUndefined(*property) && !JS_IsNull(*property) &&
                (!value_to_u32(ctx, *property, &enabled) || enabled != 0)) {
                set_pixel_raw(buffer, x + (int32_t)col, y + (int32_t)row, color);
            } else {
                set_pixel_raw(buffer, x + (int32_t)col, y + (int32_t)row, buffer->background);
            }
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    mark_dirty(buffer, x, y, (int)width, (int)height);
    return *this_val;
}

#endif
